[
  {
    "symptom":"Ankle Problems",
    "passage": "symptom: ankle problems. Ankle problems can cause a range of symptoms including:pain swelling stiffness. In many cases, new pain or a flare-up of long-standing ankle problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help: \nthere’s been new significant trauma within the last 7 days, for example a fall from height or direct blow to the ankle\nyour ankle is misshapen\nyou’ve difficulty putting weight on your leg\nyour calf is hot, swollen and tender\nyou have pain that’s worsening despite following self-care advice\n\nWhat causes ankle problems?\nAnkle problems are fairly common and can be caused by injuries like tripping or going over on your ankle. They can also be caused by a flare up of an existing problem or muscle weakness around the joint.\n\nIt’s common to have soft tissue injuries in the ankle. Soft tissues include ligaments, muscles and tendons.\nCan ankle pain cause problems anywhere else?\nYou may feel some pain in the muscles around your calf and foot. This should improve as your ankle problem gets better.\n\nAnkle problems can also cause limping. If the limp is severe, using a walking stick on the opposite side to your ankle problem may help.\nSelf-help\nThere are a number of things you can do to help your ankle problem.\n\nKeeping your ankle moving is an essential part of your treatment and recovery.\n\nHow to get moving\nWithin the first 24 to 48 hours of the onset of an ankle problem you should try to:\n\nreduce your activities but move as much as your symptoms allow\nput your ankle in an elevated position, when resting\nmove your ankle gently for 10 to 20 seconds every hour when you’re awake\navoid long periods on your feet\nWhen using stairs it may help to:\n\nlead with your good leg when going upstairs to reduce the strain on your ankle\nlead with your problem leg when going downstairs to reduce the strain on your ankle\nuse a handrail (if available) when going up and downstairs\nAfter 48 hours:\n\ntry to use your leg more – exercise really helps your ankle and can relieve pain\ndo whatever you normally would and stay at, or return to work – this is important and is the best way to get better\nIt’s beneficial to do specific exercises that can help in your recovery. They may be challenging at the beginning so just do what you can and try to build it up over time.\nBenefits of keeping active\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\n\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up before sports.\n\nPain treatments\nThe following can help to reduce the pain:\n\npain medication – this can help you move more comfortably, which can help your recovery\nheat or ice packs\nTreating with ice or heat\nHeat or ice can be beneficial in the management of musculoskeletal pain.\n\nIce is most beneficial if your ankle problem is related to an injury. You can try heat to help your pain levels if there’s no swelling and your symptoms are not related to a recent injury.\n\nNever place ice or heat directly on your skin. Use a barrier, like a towel, to protect your skin from a burn.\n\nHow long you use ice as a treatment can vary. However, you should generally apply heat or ice for up to 15 minutes. You should also leave a few hours between treatments.\n\nYou should stop treating the area with ice or heat and seek advice from a medical professional if you notice an increase in redness, discolouration or blistering of the skin.\n\nIf you have any issues with circulation or sensation, you shouldn’t use ice or heat as a treatment for ankle pain.\n\nWork\nIt’s recommended you stay at or return to work as quickly as possible during your recovery. You don’t need to be pain or symptom-free to return to work.\n\nHelp and support\nFollowing this advice, you should see gradual improvements over time.\n\nYou should see the biggest change in your symptoms within the first couple of weeks. Most problems should have improved within 6 weeks.\n\nIf your ankle problem hasn’t improved within 6 weeks of following this advice, it’s a good idea to talk to a healthcare professional about your symptoms.\n\nAnkle pain\nBy Mayo Clinic Staff\nBones, ligaments, tendons and muscles make up the ankle. It's strong enough to bear body weight and move the body. The ankle can be painful when injured or affected by illness.\n\nThe pain might be on the inside or outside of the ankle. Or it could be in back along the Achilles tendon. The Achilles tendon joins the muscles in the lower leg to the heel bone.\n\nMild ankle pain often responds well to home treatments. But it can take time for the pain to ease. See a health care provider for severe ankle pain, especially if it comes after an injury.\n\nAny ankle injury can be quite painful, at least at first. It's usually safe to try home remedies for a while.\n\nSeek immediate medical attention if you:\nHave severe pain or swelling, especially after an injury.\nPain that gets worse.\nHave an open wound or the ankle looks deformed.\nHave signs of infection, such as redness, warmth and tenderness in the affected area or a fever greater than 100 F (37.8 C).\nCannot put weight on the foot.\nSchedule an office visit if you:\nHave persistent swelling that doesn't improve after 2 to 5 days of home treatment.\nHave persistent pain that doesn't improve after several weeks.\nSelf-care\nFor many ankle injuries, self-care measures ease the pain. Examples include:\n\nRest. Keep weight off the ankle as much as possible. Take a break from regular activities.\nIce. Place an ice pack or bag of frozen peas on the ankle for 15 to 20 minutes three times a day.\nCompression. Wrap the area with a compression bandage to reduce swelling.\nElevation. Raise the foot above the level of the heart to help reduce swelling.\nPain medicines you can get without a prescription. Medicines such as ibuprofen (Advil, Motrin IB, others) and naproxen sodium (Aleve) can ease pain and aid healing.\nEven with the best of care, the ankle might swell, be stiff or hurt for several weeks. This is most likely to be first thing in the morning or after activity.",
    "questionList": [
      "What are the common symptoms of ankle problems?",
      "How long does it typically take for ankle problems to settle without seeing a healthcare professional?",
      "When should I seek medical help for ankle problems?",
      "What are the common causes of ankle problems?",
      "Can ankle pain cause problems in other parts of the body?",
      "What self-help measures can I take for ankle problems?",
      "How should I keep my ankle moving during treatment and recovery?",
      "What are the benefits of keeping active for ankle problems?",
      "What treatments can help reduce ankle pain?",
      "How should I treat ankle pain with ice or heat?"
    ]
  }
]
